In [1]:
import pandas as pd
import numpy as np
import random

* # Series is just single column of data

In [2]:
data1 = [i for i in range(10)]
data1

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [3]:
import string

In [4]:
alphalist = list(string.ascii_uppercase)
print(alphalist)

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']

In [5]:
index1 = [alphalist[i] for i in range(10)]
index1

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J']

In [6]:
series1 = pd.Series(data = data1, index = index1)

In [7]:
series1

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
I    8
J    9
dtype: int64

In [8]:
dico = {k:v for k,v in zip(index1,data1)}

In [9]:
series2 = pd.Series(dico)
series2

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
I    8
J    9
dtype: int64

In [10]:
df = pd.DataFrame(np.random.randn(5,5), index = 'A/B/C/D/E'.split('/'), columns = 'V/W/X/Y/Z'.split("/"))
df

          V         W         X         Y         Z
A -1.459363 -0.026099  0.507039 -0.847128  1.421485
B  0.148872  0.066708 -1.205658  0.149185 -1.181823
C  0.106849  1.196991 -0.768588  1.740896  0.951028
D  0.686018 -1.390904  1.299287  0.021230  1.830951
E -0.196772  0.338550 -0.079230 -1.743529 -1.073145

In [11]:
df['V']

A   -1.459363
B    0.148872
C    0.106849
D    0.686018
E   -0.196772
Name: V, dtype: float64

In [12]:
# Selectin Columns
df[['V','X']]

          V         X
A -1.459363  0.507039
B  0.148872 -1.205658
C  0.106849 -0.768588
D  0.686018  1.299287
E -0.196772 -0.079230

In [13]:
df[['W','Y']]

          W         Y
A -0.026099 -0.847128
B  0.066708  0.149185
C  1.196991  1.740896
D -1.390904  0.021230
E  0.338550 -1.743529

In [14]:
# We use iloc to select a particular row
df.iloc[0]

V   -1.459363
W   -0.026099
X    0.507039
Y   -0.847128
Z    1.421485
Name: A, dtype: float64

In [15]:
# loc for name of the row, iloc for the integer location(position) of the row
df.loc['B']['V']

0.14887195509406329

In [16]:
df[df['Z']> 0]

          V         W         X         Y         Z
A -1.459363 -0.026099  0.507039 -0.847128  1.421485
C  0.106849  1.196991 -0.768588  1.740896  0.951028
D  0.686018 -1.390904  1.299287  0.021230  1.830951

In [17]:
df['U'] = df['V']+ df['Z'] # adding new column to the dataframe

In [18]:
df

          V         W         X         Y         Z         U
A -1.459363 -0.026099  0.507039 -0.847128  1.421485 -0.037878
B  0.148872  0.066708 -1.205658  0.149185 -1.181823 -1.032951
C  0.106849  1.196991 -0.768588  1.740896  0.951028  1.057877
D  0.686018 -1.390904  1.299287  0.021230  1.830951  2.516969
E -0.196772  0.338550 -0.079230 -1.743529 -1.073145 -1.269916

In [19]:
df[df['U'] > df['V']]

          V         W         X         Y         Z         U
A -1.459363 -0.026099  0.507039 -0.847128  1.421485 -0.037878
C  0.106849  1.196991 -0.768588  1.740896  0.951028  1.057877
D  0.686018 -1.390904  1.299287  0.021230  1.830951  2.516969

In [37]:
df.loc['D'][['Z','X']]

Z    1.830951
X    1.299287
Name: D, dtype: float64

In [38]:
df[['X','Z']].loc['D']

X    1.299287
Z    1.830951
Name: D, dtype: float64

In [40]:
df.head() #First 5

          V         W         X         Y         Z         U
A -1.459363 -0.026099  0.507039 -0.847128  1.421485 -0.037878
B  0.148872  0.066708 -1.205658  0.149185 -1.181823 -1.032951
C  0.106849  1.196991 -0.768588  1.740896  0.951028  1.057877
D  0.686018 -1.390904  1.299287  0.021230  1.830951  2.516969
E -0.196772  0.338550 -0.079230 -1.743529 -1.073145 -1.269916

In [42]:
df.tail() #Last 5

          V         W         X         Y         Z         U
A -1.459363 -0.026099  0.507039 -0.847128  1.421485 -0.037878
B  0.148872  0.066708 -1.205658  0.149185 -1.181823 -1.032951
C  0.106849  1.196991 -0.768588  1.740896  0.951028  1.057877
D  0.686018 -1.390904  1.299287  0.021230  1.830951  2.516969
E -0.196772  0.338550 -0.079230 -1.743529 -1.073145 -1.269916

# Concatinate

In [55]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['C0','C1','C2','C3'],
                   'C':['C0','C1','C2','C3']},index =[0,1,2,3])
df1
df2 = pd.DataFrame({'A':['A4','A5','A6','A7']},index = [4,5,6,7])

In [56]:
pd.concat([df1,df2],axis =1)

     A    B    C    A
0   A0   C0   C0  NaN
1   A1   C1   C1  NaN
2   A2   C2   C2  NaN
3   A3   C3   C3  NaN
4  NaN  NaN  NaN   A4
5  NaN  NaN  NaN   A5
6  NaN  NaN  NaN   A6
7  NaN  NaN  NaN   A7

# Merging and joining DataFrame